// Menu texts
MenuTextShowPeripherals = "Show Peripherals";
MenuTextHidePeripherals = "Hide Peripherals";
MenuTextShowPerformance = "Show Performance";
MenuTextHidePerformance = "Hide Performance";
FreezeMenuText = "Freeze Virtual Machine";
UnfreezeMenuText = "Resume Virtual Machine";
CharSetMenuLatin = "Latin";
CharSetMenuLatinUpper = "Latin Uppercase Only";
CharSetMenuGreek = "Greek";
CharSetMenuGerman = "German";
CharSetMenuFrench = "French";
CharSetMenuBritish = "British";
CharSetMenuItalian = "Italian";
CharSetMenuSwedish = "Swedish";
CharSetMenuBulgarian = "Bulgarian";
UnixFilesSerialPortMenuItemTitle = "Unix Named Pipes";

// The popup menu in the "serial port button" (VIISerialPortButton)
SerialPortMenuForceDSR = "Force DSR input line to be on";
SerialPortMenuForceDCD = "Force DCD input line to be on";
SerialPortMenuForceCTS = "Force CTS input line to be on";
SerialPortMenuUseAsyncSend = "Use asynchronous send";
SerialPortMenuTooltip = "Read the manual for an explanation";
UnixFilesSerialPortToolTip = "The serial data is read from, and written to, named pipes in the designated directory";

// Window title and other window texts
ComputerTypeTitle0 = "Apple ][   %@";	// Used in window title
ComputerTypeTitle1 = "Apple ][+   %@";	// Used in window title
ComputerTypeTitle2 = "Apple //e   %@";	// Used in window title
RecordText = "Record";		// Main button in tape save dialog
PlayText = "Play";			// Main button in tape open dialog
SelectButtonText = "Select";	// used in folder selection dialogs
GameConnConfigTitle = "Configure Game Controller";
ConfirmRemoveDiskFromConfig = "Are you sure you want to remove the disk image \"%@\" from the configuration?";
YesButtonText = "Yes";
NoButtonText = "No";
CancelButtonText = "Cancel";
OKButtonText = "OK";
NotifyAuthorButtonText = "E-mail the author";
RightAwayButtonText = "Let me do it now";
ShowInvalidDOSNamesButton = "Show Details";
MappedFolderMountedText = "This folder is mounted as a DOS diskette. Macintosh files will be updated when the dialog is closed.";
MappedFolderNotMountedText = "This folder is currently not mounted. The Macintosh files will not be updated.";
ShareCharSetReminder = "If you created a useful character set, please consider sending it to the author of Virtual ][, so it can be included in the application.";
DontSaveAndDiscard = "Don't save; the stored state will be removed from the file (⌘-D)";
DontSaveAndKeep = "Don't save; the stored state is still valid and will be kept (⌘-D)";
SelectFavoriteDiskFolder = "Select the folder where your disk images are";
RegularSpeedIndication = "regular speed";
HighSpeedIndication = "high speed";
MaximumSpeedIndication = "maximum speed";
ResetProDosFolderButtonText = "Reset";
GameControllerPresentText = "Game controller found";		// In the Game controller configuration
GameControllerNotPresentText = "No game controller found";	// In the Game controller configuration
DownloadPreparing = "Connecting to %@";
Downloading = "Downloading...";
GrapplerTransparentCheckboxText = "Transparent Mode";
ThunderclockEnableSettingText = "Allow setting the time";
SerialErrReInitButton = "Re-initialize";
SerialErrReInitButtonToolTip = "Fully reset the emulated serial device. You might have to re-establish the connection to the attached serial device.";
SerialErrDisconnectButton = "Remove";
SerialErrDisconnectButtonToolTip = "Remove the emulated serial device. You can select a different device in the machine setup.";
DiskSearchStatusLineSingle = "1 disk";
DiskSearchStatusLinePlural = "%d disks";
DiskSearchGathering = "Gathering data...";
SetDiskPropertiesTitle = "Set Disk Properties";
SetDiskPropertiesPrompt = "Set Properties";
DumpMemorySaveAsTitle = "Dump Memory to a File";
DumpMemorySaveAsPrompt = "Dump Memory";
RecordingIndicatorText = "recording";

// Used in Performance Monitor:
CPUZ80Title = "Z80A";		// Used in performance display
CPU6502Title = "6502";
CPU65C02Title = "65C02";

// The "Full screen alert"
FullscreenInfo = "During full screen mode the menu and dock are unavailable. Command-Enter takes you back to window mode.";
FullscreenNotAgain = "OK, Don't show again";

// The "relative mouse" alert
RelativeMouseReminder = "In relative mouse mode, you'll need to hold down the command (⌘) key in order to move the mouse outside the Apple II screen and get back the Macintosh mouse pointer.";

// Tool tips
ToolTipBlankDiskButton = "Insert a new, blank diskette into a drive";
ToolTipExistingDiskButton = "Insert an existing diskette into a drive";
ToolTipBlankOmniDiskButton = "Create a new ProDos hard disk image";
ToolTipExistingOmniDiskButton = "Mount an existing ProDos hard disk image";
ToolTipBlankCassetteButton = "Make a recording on a new, empty cassette tape";
ToolTipExistingCassetteButton = "Play an existing cassette tape";
ToolTipDrive = "Slot %d, drive %d";
ToolTipPrinterOnline = "Slot %d, online; %@";
ToolTipPrinterOffline = "Slot %d, offline; %@";
ToolTipTapeEmpty = "Cassette recorder";
ToolTipTapePlaying = "Cassette recorder is playing tape \"%@\"";
ToolTipTapeRecording = "Cassette recorder is recording to tape \"%@\"";
ToolTipROIndication = "\n(Write protected)";
ToolTipDisabledNoSlotClock = "The button is disabled because the no-slot clock only works with an Apple //e";
ToolTipAutoLF_Epson = "This toggles DIP switch 2-4";
ToolTip8thBit_Epson = "Whether or not the (parallel) printer cable supports the high-order bit of a byte";
ToolTipAutoLF_IWII = "This toggles DIP switch 1-8";
TooltipGrapplerTransparentMode = "When checked, the card sends all data to the printer without processing. When unchecked, the card processes the control codes it recognizes.";
TooltipThunderclockEnableSetting = "When checked, Apple II software is allowed to set the time";
TooltipSerialPortButton = "%@ connected to slot %d";
TooltipNoSerialDevice = "No serial device";
TooltipNeedFullLicense = "You need a full license to use this feature"; // Used eithet stand-alone or appended to another tooltip
TooltipNeedSlowDownWhenIdle = "This preserves energy by slowing down the emulated CPU if the Apple II is idle and you run in high speed or maximum speed mode";

// Generic errors
UnknownError = "An unknown error occurred";
CantUseEmailErr = "Error while using the \"Mail\" service. Please use your e-mail program to send mail to %@";
OSTooLowErr = "This program requires Mac OS X 10.4 or better";
ExpiredBeta = "This beta version of Virtual ][ has expired; please download the latest release";
FullscreenError = "Unable to switch to full screen mode";
NoDefaultFileErr = "Unable to open the configuration file \"%@\"; a default Apple //e will be created instead";
InvalidDefaultFileErr = "The configuration file \"%@\" is invalid; a default Apple //e will be created instead";
UnsupportedDefaultFileErr = "The configuration file \"%@\" contains unsupported features; a default Apple //e will be created instead";
CannotOpenDirectory = "The folder \"%@\" cannot be opened";
CannotWriteMapping = "Unable to save the DOS type mappings";
WrongStartingAddressErr = "The address must be an integer between 0 ($0) and 65535 ($FFFF)";
CantLoadConfiguredDisk = "Unable to load the disk \"%@\"";
FolderHasInvalidDOSFiles = "Some of the files in folder \"%@\" are not valid in Apple DOS";
FolderAlreadyMountedErr = "The folder \"%@\" has already been mounted as a disk";
CouldntOpenFavoriteDiskFolderErr = "In order to use this function, you must first set the \"favorite disk folder\" in the application preferences.";
CantCreateDefaultConfigErr = "An error occurred while setting the default configuration";
DownloadCannotHandleErr = "Unable to download URL \"%@\"";
DownloadTooBigErr = "Download is too big";
DownloadCancelledByUser = "Download cancelled by user";
CantSaveFileErr = "Unable to save the file";
CantReboot = "%@; unable to finish the restart operation";
DumpMemoryAddressError = "The action could not be performed: the end address must be equal to or higher than the start address";

// Disk storage type names used in DiskOverview. Linked to enum DiskStorageType
// TODO: Consider this. If we don;t need it anymore, remove.
DiskStorageType0 = "N/A";      // No disk
DiskStorageType1 = "Diskette image file";
DiskStorageType2 = "Mac folder mounted as DOS volume";
DiskStorageType3 = "Omnidisk image file";
DiskStorageType4 = "Mac folder mounted as Prodos volume";
DiskStorageType5 = "Downloaded (temporary) diskette image";

// Version and upgrade strings
CannotCheckVersionErr = "An error occurred while checking for updates";
SoftwareIsUpToDate = "The software is up-to-date";
YouHaveMostRecent = "You have the most recent version (%@) of Virtual ][.";
NewVersionAvailable = "A new version is available";
CanDownloadNew = "Virtual ][ version %@ is available for download.";
DownloadNewVersionNow = "Download now";			// Button

// Serial Port implementer messages
WontRepeatInVMText = ". This message will not be repeated for this serial connection.";	// Is appended after other messages, hence the period at the start.
SetDTR_RTS_Err = "Unable to set the DTR/RTS signals on serial port \"%@\"; error code = %d (%s).";
SetParityErr = "Unable to set parity on serial port \"%@\"; error code = %d (%s).";
ParityUnsupportedErr = "Unable to set unsupported parity \"%@\" on the serial port";
StopBit15UnsupportedErr = "Unable to set unsupported \"1.5 stop bits\" on the serial port";
SetDataAndStopBitsErr = "Unable to set the number of data and stop bits on serial port \"%@\"; error code = %d (%s).";
SetBaudrateErr = "Unable to set baud rate on serial port \"%@\"; error code = %d (%s).";
SendBreakErr = "Unable to send a break signal to serial port \"%@\"; error code = %d (%s).";
SendByteErr = "Unable to send data to serial port \"%@\"; error code = %d (%s).";
GetInputLinesErr = "Unable to get the input signals on serial port \"%@\"; error code = %d (%s).";
SerialReadErr = "An error occurred while reading serial port \"%@\"; error code = %d (%s).";
ReInitExplanation = "\n\nDo you want to try and re-initialize the emulated serial device in slot %d, or remove it?";

// Diskette error messages. Note we include a placeholder for the path name of the file.
// When opening the file explicitly, this will not add useful information for the user,
// but it is indispensible information if the disk image is opened from a saved state.
VIIDiskette01 = "The disk image \"%@\" has an unknown format";
VIIDiskette02 = "The disk image \"%@\" cannot be accessed";
VIIDiskette03 = "The disk image file \"%@\" does not exist";
VIIDiskette04 = "The disk image file \"%@\" could not be opened";
VIIDiskette05 = "The disk image \"%@\" is already in use";
VIIDiskette06 = "Unable to write to the disk image file \"%@\"";
VIIDiskette07 = "The disk image file \"%@\" could not be created";
VIIDiskette08 = "The disk image \"%@\" contains an error";
VIIDiskette09 = "The disk image \"%@\" contains too many tracks";
VIIDiskette11 = "Configure a virtual SCSI card + OmniDisk to load the disk image \"%@\"";
VIIDiskette12 = "The application does not support 3.5\" diskettes";
VIIDiskette99 = "The disk \"%@\" has been modified in a way that is incompatible with the disk image file, and can therefore not be saved.\n\nUsing a copy of the disk converted to .woz format will probably solve this issue.";

VIIDiskDriveItem90 = "The alias file \"%@\" cannot be resolved";

// Diskette storage error messages
VIIDisketteStorage02 = "The files in folder \"%@\" don't fit on a diskette";
VIIDisketteStorage04 = "The disk \"%@\" cannot be saved beacuse it is not a DOS volume";
VIIDisketteStorage05 = "Unable to write to the file \"%@\"";
VIIDisketteStorage06 = "Can't create the saved disk at path \"%@\"";

// URL mounting error messages
VIIURLDisketteStorage01 = "The URL \"%@\" cannot be found";
VIIURLDisketteStorage02 = "The data format is unsupported";

// Hard Disk error messages. Don't report file names here; the mechanism works
// different than diskettes, and the name in the error message is provided in a different way.
HDErr01 = "The disk image has an unknown format";
HDErr02 = "The disk image cannot be accessed";
HDErr03 = "The disk image file does not exist";
HDErr04 = "The disk image file could not be opened";
HDErr05 = "The disk image is already in use";
HDErr06 = "Unable to read data from the disk image file";
HDErr07 = "Unable to write data to the disk image file";
HDErr08 = "The disk image file could not be created";

// Printer error messages
VIIASCIIPrinter01 = "Unable to open the printer file \"%@\" for writing";
VIIASCIIPrinter02 = "Unable to open the printer file; the path \"%@\" is invalid";
VIIASCIIPrinter03 = "Unable to create the printer file \"%@\"";
VIIASCIIPrinter04 = "The printer file \"%@\" is already in use";

// Serial port error messages
VIISerialPort01 = "Unable to find a serial port named \"%@\". Please reconfigure the device connected to the Super Serial card in slot %d.";
VIISerialPort02 = "Unable to open the serial port \"%@\". Please reconfigure the device connected to the Super Serial card in slot %d.";
VIISerialPort03 = "Unable to initialize the serial port \"%@\". Please reconfigure the device connected to the Super Serial card in slot %d.";
VIISerialPort04 = "Unable to initialize the serial port \"%@\" for the Super Serial card in slot %d. The port is already in use by another virtual machine.";

VIISerialImplementerFactoryIDText = "Error in serial stream \"%@\" (slot %d)."; // Text is prepended in the other error messages.
VIISerialImplementerFactory01 = "Cannot create the stream; URL is invalid.";
VIISerialImplementerFactory02 = "Cannot create the stream; URL should point to an existing  file.";
VIISerialImplementerFactory03 = "Cannot create the stream; check system log for details.";

// Printer messages
PrinterNoProportionalWarning = "The Apple ][ software tries to set the printer in \"proportional\" character mode. However, this feature is not supported by Virtual ][.\nThis message will not be repeated while Virtual ][ is active.";
PrinterDeleteContentsWarning = "This action clears the print output. Continue?";
PrintingToClipboardInfo = "This printer is configured to print to the Macintosh clipboard. After printing has completed, you can paste the output into any text editor or word processing program.";

// Shared ProDos disk
VIIProDosSharedDisk01 = "The folder \"%@\" cannot be mounted; it doesn't exist";
VIIProDosSharedDisk02 = "The folder \"%@\" cannot be mounted because you are not the owner";
VIIProDosSharedDisk03 = "The folder \"%@\" cannot be mounted; you have not enough access privileges. Perhaps the folder is already mounted in Virtual ][?";
VIIProDosSharedDisk04 = "The folder \"%@\" cannot be mounted because of an internal error (VIIProDosSharedDisk04). Please contact the author.";
VIIProDosSharedDisk05 = "The folder \"%@\" cannot be mounted because it has been changed after the machine state was saved";
CannotResetWhileMountedErr = "Unable to reset the shared folder because it is still mounted";
MustBeOwnerToResetErr = "You don't have enough privileges to reset the folder (you must be its owner to do so)";
UnSupportedProDosOperationErr = "This ProDos operation is not supported for a mounted folder";
VIIVirtualProDosCatalog01 = "The folder cannot be mounted because it is too big. A ProDOS disk is limited to 32 MB.";
VIIProDosDirCatNode01 = "The folder cannot be mounted because it contains too many items at the top level; the maximum allowed is %@.";
VIIProDosFileCatNode01 = "The folder cannot be mounted because the file \"%@\" could not be found (internal error).";
VIIProDosFileCatNode02 = "The folder cannot be mounted because the file \"%@\" is too big (the maximum size allowed in ProDOS is 16 MB).";
ProDosSharedDiskLimitedLicenseUse = "Your license allows only limited use of the ProDOS mounted folder feature. You will be able to see the ProDOS directories, but you cannot read or write files.\nFor unrestricted access, upgrade to a full license.";
ProDosSharedDiskLimitedEvalUse = "The evaluation version of Virtual ][ allows only limited use of the ProDOS mounted folder feature. You will be able to see the ProDOS directories, but you cannot read or write files.\nFor unrestricted access, purchase a full license.";

// Tape error messages
VIITapeErrOpen = "Unable to process the cassette tape file \"%@\"";

// (De)serialization errors
VIICassetteOutImplementer01 = "Unable to continue writing to cassette tape file \"%@\"";
VIICassetteInSource01 = "Unable to continue processing the cassette tape file \"%@\"";
VIIHardDisk01 = "Unable to mount hard disk image from \"%@\"";
AIIStream01 = "Not enough memory available to save / restore";
AIIStream02 = "Unable to restore because the data is incomplete";
AIIStream03 = "An unexpected error occurred while saving";
AIIStream04 = "An unexpected error occurred while restoring";
AIIStream05 = "The document is not compatible with this version of Virtual ][";
AIIStream06 = "Unable to restore because the file has an unknown format";
VIIDocument01 = "Unable to restore the cassette tape drive";
AIIComputerPart01 = "Unable to restore because the file has an unknown format";	// Should have been AIIStream06, but this one is still used in the engine

// AIIComputer error messages
AIIComputer01 = "Unable to open the configured ROM image file\n\"%@\".";

// Character set error messages
CharacterSet01 = "The file \"%@\" is not a valid character set definition. Refer to the Help section for details.";
CharacterSet02 = "The character set file \"%@\" is not valid because the width of the bitmap must be 128. Refer to the Help section for details.";
CharacterSet03 = "The character set file \"%@\" is not valid because the height of the bitmap must be 64 or more. Refer to the Help section for details.";
CharacterSet04 = "The character set file \"%@\" is not valid because the bitmap must have 1 bit per pixel. Refer to the Help section for details.";
CharacterSet05 = "The character set file \"%@\" does not exist";
NoSuchIntlErr = "The international settings named \"%@\" cannot be found. The default international settings will be used instead.";

// Licensing error (and other) messages
LicenseCodeWrongFmtText = "The license code you provided has a wrong format. Please retry.";
LicenseCodeEnterEmailText = "Please enter the e-mail address provided with your license.";
LicenseCodeEnterCodeText = "Please enter the license code.";
LicenseNoEmailMatchText = "Unable to license the application, because the e-mail address provided does not match the license code.";
LicenseNoInternetText = "Unable to access the online license data; make sure the computer is connected to the Internet, then try again.";
LicenseCantVerify = "An error occurred while validating the license code. Re-install the program, or contact the author.";
LicenseBlacklistedText = "This license code has been withdrawn. Please contact the author.";
LicenseNotWhitelistedText = "There seems to be a problem with your license. Please contact the author.";
LicenseNeedsLimitedLicenseText = "The code you entered is an upgrade from the limited license to the full license. Please enter a limited license code first, then try again.";
LicenseCantCreateFileText = "Unable to create the file \"~/Library/Application Support/Virtual ][/License\"";
LicenseNotForVIIText = "Unable to license the application, because the code provided is not a Virtual ][ license code.";
UnlicensedVersionText = "This is an unlicensed version.";
FullLicensedVersionText = "This is a full-license version with license code\n\n%@";
LimitedLicensedVersionText = "This is a limited-license version with license code\n\n%@";
LicenseInfoText = "Virtual ][ license Info";
EvalCannotRestoreState = "To continue running this virtual machine from where it left off, you need a licensed version of Virtual ][.";
BuyLicenseNowButton = "I'll Buy a License Now";
BuyLicenseLaterButton = "I'll Buy a License Later";

// Configuration errors
VIIConfiguration03 = "The configuration cannot be used because it contains an unsupported feature.";

// Movie recording error messages. The numbers correspond to the numeric error values in the AnimatedMovieMaker class
MovieRecording01 = "Internal error #1";		// Did not set delegate
MovieRecording02 = "Internal error #2";		// Already recording
MovieRecording03 = "Cannot create the movie";	// The movie object or the final movie file
MovieRecording04 = "Unable to write to the movie file";
MovieRecording05 = "An unknown error occurred while recording the movie";
MovieRecording06 = "Internal error #6";
MovieErrorTitle = "Movie error";
MovieDroppedFramesWarning = "During recording, one or more frames were dropped. Please play the movie to check the result.\n\nTotal number of dropped frames = %ld";

// Crashlytics note
CLAlertMessage = "Note";
CLAlertInfoText = "Virtual ][ automatically submits anonymous reports that help the developer improve the application.\n\nIf you don't want such reports sent, you can disable this feature in the application preferences.";
CLAlertButtonText = "I Understand";

// Color list
VIIColorListName = "Virtual ][ monochrome";
VIIGreenPhosphor = "Green";
VIIAmberPhosphor = "Amber";
VIIWhitePhosphor = "White";

// Other stuff
FanfoldPaperName = "%d inch fanfold paper";
ExportedScreenName = "Screen%d";

// Inspector
NoStackDataStr = "No stack data is available";
EmptyStackStr = "The stack is empty";
TopOfStackStr = "-Top of stack-";
InspectorCantStepOutErr = "Cannot step out because not enough data is available";
InspectorCantStepOutInfo = "Cannot step out because the machine currently is not in a subroutine or interrupt";
ValueMustBeHexAddrErr = "The value must be a hexadecimal address in the range 0 to FFFF";
InspectorNoCardInserted = "Slot %d - no card inserted";
InspectorCardTypeNN = "card type %d";
InspectorFullCardIODesc = "Slot %d - %@";
InspectorStatusRunning = "Apple II is running";
InspectorStatus01 = "Stopped at breakpoint";	// These values correspnd with IAIIInspectorEventHandler::BreakpointReason
InspectorStatus02 = "Stopped at BRK instruction";
InspectorStatus03 = "Stopped at invalid instruction";
InspectorStatus04 = "Stopped after step";
InspectorStatus05 = "Stopped on user request";
InspectorStatus06 = "Stopped at memory watchpoint (%04X: %02X ⇨ %02X)";
InspectorStatus07 = "Stopped at processor watchpoint (%@:  %02X ⇨ %02X)";
InspectorStatus08 = "Stopped because of fetch from I/O address (%04X)";
InspectorStatus09 = "Stopped because of put to I/O address (%04X := %02X)";
InspectorStatus99 = "Stopped";
InspectAppleIINoRAMCard = "The current machine is an %@ with %d KB memory";
InspectAppleIIe = "The current machine is an Apple //e with %d memory banks of 64 KB each";
InspectAppleIIe1Bank = "The current machine is an Apple //e with 64 KB RAM";
DiskInspectorNoDisk = "The drive does not contain a diskette";
DiskInspectorNoDiskData = "No disk data is available";
DiskInspectorBitStreamDisksNotSupported = "The disk inspector does not support the \"woz\" format";
DiskInspectorAddressPrologue = "A";		// How it shows up in the ASCII part of the hex dump
DiskInspectorDataPrologue = "D";
DiskInspectorEpilogue = "E";
DiskInspectorGap = "-";

// These are the names of the processor items (VIIInspectorSettings::ProcessorWatchpoint::ProcessorItem) as shown in the Inspector status:
ProcessorItem00 = "A";
ProcessorItem01 = "X";
ProcessorItem02 = "Y";
ProcessorItem03 = "S";
ProcessorItem04 = "P";
ProcessorItem05 = "Flag N";
ProcessorItem06 = "Flag V";
ProcessorItem07 = "Flag B";
ProcessorItem08 = "Flag D";
ProcessorItem09 = "Flag I";
ProcessorItem10 = "Flag Z";
ProcessorItem11 = "Flag C";

// Configuration
CfgEmpty = "empty";							// Denotes an empty connection (like an empty slot)
CfgSlotConnections = "Slot connections";	// Group item for all slots
CfgSlot = "Slot %d";
CfgAuxSlot = "Slot aux";
CfgBuiltInConnections = "Built-in connections";	// Group item
CfgComponents = "Components";					// Group item
CfgMachine0 = "Apple ][";						// Names of top level
CfgMachine1 = "Apple ][+";						// Names of top level
CfgMachine2 = "Apple //e";						// Names of top level
CfgVideoOut = "Video out";
CfgCassetteInterface = "Cassette interface";
CfgSpeaker = "Speaker";
CfgGameConnector = "Game connector";
CfgProcessor = "CPU";
CfgRAMMemory = "RAM memory";
CfgROMMemory = "ROM memory";
CfgKeyboard = "Keyboard";
CfgCharGen = "Character generator";
CfgNoSlotClock = "No-slot Clock";
CfgMonitor = "Monitor";
CfgVideoSwitch = "Soft switch";
CfgCardType01 = "Disk ][ card";
CfgCardType02 = "Printer card";
CfgCardType03 = "16K RAM card";
CfgCardType04 = "AppleClock card";
CfgCardType05 = "80-column card";
CfgCardType06 = "RamWorks card";
CfgCardType07 = "Mouse card";
CfgCardType08 = "Z80 card";
CfgCardType10 = "SCSI II card";
CfgCardType11 = "ProDos Clock card";
CfgCardType13 = "Super Serial card";
CfgCardType14 = "Grappler+ card";
CfgCardType15 = "Mockingboard";
CfgCardType16 = "Serial printer card";
CfgCardType17 = "Thunderclock card";
CfgCardType18 = "128K Saturn card";
CfgDevConn = "Connection %d";
CfgDevType01 = "Text printer";
CfgDevType02 = "Disk ][";
CfgDevType03 = "Recorder";
CfgDevType04 = "OmniDisk™";
CfgDevType05 = "Epson FX-80";
CfgDevType06 = "ImageWriter II";
CfgZ80Processor = "Z80A CPU @ %d MHz";
CfgRamWorksCapacity = "%dK on card (= %dK total)";
CfgNoSerialDevice = "No serial device selected";
RestartWarning = "Must restart the virtual machine";
RestartButtonText = "Restart";
SpeedAllowsSoundWarning = "";
SpeedDeniesSoundWarning = "This speed disables sound and cassette!";
EpsonNotSupportedMenuText = "Epson FX-80";
EpsonNotInEvalMenuText = "Epson FX-80 (only in full-licensed version)";
NoSuitableROMDetectedWarning = "No suitable ROM file was found for this machine type";
AutomaticallyDetectedROMHeader = "Automatically detected ROM";
ExplicitlyConfiguredROMHeader = "Manually configured ROM";

// Game controller configuration
paddle0analog = "Paddle #0 Analog Value";
paddle1analog = "Paddle #1 Analog Value";
paddle2analog = "Paddle #2 Analog Value";
paddle3analog = "Paddle #3 Analog Value";
paddle0button = "Paddle #0 Button";
paddle1button = "Paddle #1 Button";
paddle2button = "Paddle #2 Button";
pauseAndResume = "Pause / Resume Virtual Machine";
pausePlusConfigure = "Pause and Configure";
LinkElementToAction = "Link To";
UnlinkElementAndAction = "Unlink";
ElementsToolTip = "Tip: you can move or press a control on your game pad to select it in this list";
ActionsToolTip = "Select one item in each of the two lists, then click the (Un)Link button";
GCCalibrationInfo = "1. Move all joysticks and sliders on your game pad as far as they can go, in all directions.\n\n2. Make sure all controls are in their \"neutral\" positions, then click OK.";
GCCalibrationTitle = "Calibrate";      // Device name will be appended at run time

// Toolbar
DocTBResetPaletteLabel = "Reset";	// Include this to avoid annoying log message with Tiger
DocTBRestartPaletteLabel = "Boot";
DocTBColorLabel = "Color";
DocTBColorPaletteLabel = "Toggle color monitor";
DocTBColorTip = "Switch between color and monochrome";
DocTBCapsLockLabel = "Caps";
DocTBCapsLockPaletteLabel = "Soft caps lock";
DocTBCapsLockTip = "When activated, characters typed are converted to uppercase";
DocTBScanlinesLabel = "Lines";
DocTBScanlinesPaletteLabel = "Toggle scanlines";
DocTBScanlinesTip = "Show / hide horizontal scan lines";
DocTBResetLabel = "Reset";
DocTBResetTip = "Resets the virtual machine";
DocTBRestartLabel = "Boot";
DocTBRestartTip = "Cold boots the virtual machine";
DocTBFreezeLabel = "Freeze";
DocTBFreezePaletteLabel = "Pause / resume";
DocTBFreezeTip = "Pause / resume the virtual machine";
DocTBPerfMonLabel = "Mon";
DocTBPerfMonPaletteLabel = "Performance monitor";
DocTBPerfMonTip = "Show / hide the performance monitor";
DocTBSpeakerVolLabel = "Sound";
DocTBSpeakerVolPaletteLabel = "Sound volume";
DocTBSpeakerVolTip = "Adjust the sound volume";
DocTBPhosphorLabel = "Tint";
DocTBPhosphorPaletteLabel = "Set monochrome color";
DocTBPhosphorTip = "Choose the phosphor color of the monochrome monitor";
DocTBGamepadLabel = "Pad";
DocTBGamepadPaletteLabel = "Configure game pad";
DocTBGamepadTip = "Configure a connected USB or Bluetooth gamepad";
DocTBFavDiskFolderLabel = "Disks";
DocTBFavDiskFolderPaletteLabel = "Open favorite disk folder";
DocTBFavDiskFolderTip = "Opens a Finder window for the folder you choose as \"favorite disk folder\" in the application preferences";
DocTBConfigLabel = "Setup";
DocTBConfigPaletteLabel = "Configure";
DocTBConfigTip = "Configure this virtual machine";
DocTBMaximizeSpeedLabel = "Fast";
DocTBMaximizeSpeedPaletteLabel = "Maximize speed";
DocTBMaximizeSpeedTip = "Puts the machine in a high speed mode whenever possible";
DocTBSpeedLabel = "Speed";
DocTBSpeedPaletteLabel = "Speed";
DocTBSpeedTip = "Change machine speed. Current setting is \"regular\": the emulator runs at the speed of the original Apple machine";
DocTBSpeedTipRegular = "Change machine speed. Current setting is \"regular\": the emulator runs at the speed of the original Apple machine";
DocTBSpeedTipHigh = "Change machine speed. Current setting is \"high\": the emulator runs as fast as it can, except when generating screen output or sound";
DocTBSpeedTipMaximum = "Change machine speed. Current setting is \"maximum\": the emulator runs as fast as it can, except when generating sound";

/* Descriptions (used in Inspector), for I/O addresses.  The name is composed of a string, a subject ID and a 
   number. The string is always the same, and serves to identify the entry, it is always "IODescription".
   The subject ID says if the description is part of the generic I/O range (C000-C08F), or part of an interface
   card. In the latter case the subject ID is the number (two decimal digits) of the card, as defined in
   PeripheralCardType in AIIPrefs.h. The generic part is identified by subject ID 00.
   Finally, the final number is two hexadecimal digits, identifying the low order digit (4 bits) of the addres 
   when the address is >= C080, or the number is the full low order byte (8 bits, two hexadecial digits). */
IODescription0000 = "Read keyboard data main (fetch); clear 80STORE memory mode (put; //e only)";		// $C000
IODescription0001 = "Read keyboard data alternative (fetch); set 80STORE memory mode (put; //e only)";
IODescription0002 = "Read keyboard data alternative (fetch); read main memory (put; //e only)";
IODescription0003 = "Read keyboard data alternative (fetch); read auxiliary memory (put; //e only)";
IODescription0004 = "Read keyboard data alternative (fetch); write main memory (put; //e only)";
IODescription0005 = "Read keyboard data alternative (fetch); write auxiliary memory (put; //e only)";
IODescription0006 = "Read keyboard data alternative (fetch); use ROM on peripheral cards (put; //e only)";
IODescription0007 = "Read keyboard data alternative (fetch); use internal ROM (put; //e only)";
IODescription0008 = "Read keyboard data alternative (fetch); use main memory stack and zero page (put; //e only)";
IODescription0009 = "Read keyboard data alternative (fetch); use auxiliary memory stack and zero page (put; //e only)";
IODescription000A = "Read keyboard data alternative (fetch); use internal ROM in slot 3 range (put; //e only)";
IODescription000B = "Read keyboard data alternative (fetch); use ROM on card in slot 3 (put; //e only)";
IODescription000C = "Read keyboard data alternative (fetch); disable 80-column display (put; //e only)";
IODescription000D = "Read keyboard data alternative (fetch); enable 80-column display (put; //e only)";
IODescription000E = "Read keyboard data alternative (fetch); disable alternate character set (put; //e only)";
IODescription000F = "Read keyboard data alternative (fetch); enable alternate character set (put; //e only)";
IODescription0010 = "Clear keyboard strobe main (fetch / put; all models); \"any key down\" flag (fetch; //e only)";		// $C010
IODescription0011 = "Clear keyboard strobe alternative (fetch / put); read language card bank 2 switch (fetch; //e only)";
IODescription0012 = "Clear keyboard strobe alternative (fetch / put); read language card read status (fetch; //e only)";
IODescription0013 = "Clear keyboard strobe alternative (fetch / put); read RAMRD switch (fetch; //e only)";
IODescription0014 = "Clear keyboard strobe alternative (fetch / put); read RAMWRT switch (fetch; //e only)";
IODescription0015 = "Clear keyboard strobe alternative (fetch / put); read internal ROM switch (fetch; //e only)";
IODescription0016 = "Clear keyboard strobe alternative (fetch / put); read ALTZP switch (fetch; //e only)";
IODescription0017 = "Clear keyboard strobe alternative (fetch / put); read slot 3 ROM use (fetch; //e only)";
IODescription0018 = "Clear keyboard strobe alternative (fetch / put); read 80STORE switch (fetch; //e only)";
IODescription0019 = "Clear keyboard strobe alternative (fetch / put); read VBL status (fetch; //e only)";
IODescription001A = "Clear keyboard strobe alternative (fetch / put); read video text mode (fetch; //e only)";
IODescription001B = "Clear keyboard strobe alternative (fetch / put); read video mixed mode (fetch; //e only)";
IODescription001C = "Clear keyboard strobe alternative (fetch / put); read video page 2 mode (fetch; //e only)";
IODescription001D = "Clear keyboard strobe alternative (fetch / put); read video hires graphics mode (fetch; //e only)";
IODescription001E = "Clear keyboard strobe alternative (fetch / put); read alternate character set mode (fetch; //e only)";
IODescription001F = "Clear keyboard strobe alternative (fetch / put); read video 80-column display mode (fetch; //e only)";
IODescription0020 = "Toggle cassette tape output main (fetch / put)";		// $C020
IODescription0021 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0022 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0023 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0024 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0025 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0026 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0027 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0028 = "Toggle cassette tape output alternative (fetch / put)";
IODescription0029 = "Toggle cassette tape output alternative (fetch / put)";
IODescription002A = "Toggle cassette tape output alternative (fetch / put)";
IODescription002B = "Toggle cassette tape output alternative (fetch / put)";
IODescription002C = "Toggle cassette tape output alternative (fetch / put)";
IODescription002D = "Toggle cassette tape output alternative (fetch / put)";
IODescription002E = "Toggle cassette tape output alternative (fetch / put)";
IODescription002F = "Toggle cassette tape output alternative (fetch / put)";
IODescription0030 = "Toggle speaker main (fetch / put)";		// $C030
IODescription0031 = "Toggle speaker alternative (fetch / put)";
IODescription0032 = "Toggle speaker alternative (fetch / put)";
IODescription0033 = "Toggle speaker alternative (fetch / put)";
IODescription0034 = "Toggle speaker alternative (fetch / put)";
IODescription0035 = "Toggle speaker alternative (fetch / put)";
IODescription0036 = "Toggle speaker alternative (fetch / put)";
IODescription0037 = "Toggle speaker alternative (fetch / put)";
IODescription0038 = "Toggle speaker alternative (fetch / put)";
IODescription0039 = "Toggle speaker alternative (fetch / put)";
IODescription003A = "Toggle speaker alternative (fetch / put)";
IODescription003B = "Toggle speaker alternative (fetch / put)";
IODescription003C = "Toggle speaker alternative (fetch / put)";
IODescription003D = "Toggle speaker alternative (fetch / put)";
IODescription003E = "Toggle speaker alternative (fetch / put)";
IODescription003F = "Toggle speaker alternative (fetch / put)";
IODescription0040 = "Utility strobe of game connector main (fetch; not supported)";		// $C040
IODescription0041 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0042 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0043 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0044 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0045 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0046 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0047 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0048 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0049 = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004A = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004B = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004C = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004D = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004E = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription004F = "Utility strobe of game connector alternative (fetch; not supported)";
IODescription0050 = "Display graphics mode (fetch / put)";		// $C050
IODescription0051 = "Display text mode (fetch / put)";
IODescription0052 = "Display all text or graphics (fetch / put)";
IODescription0053 = "Mix text and graphics (put)";
IODescription0054 = "Display the primary page (fetch / put)";
IODescription0055 = "Display the secondary page (fetch / put)";
IODescription0056 = "Display low resolution graphics (fetch / put)";
IODescription0057 = "Display high resolution graphics (fetch / put)";
IODescription0058 = "Set game connector annunciator 0 off (fetch / put)";
IODescription0059 = "Set game connector annunciator 0 on (fetch / put)";
IODescription005A = "Set game connector annunciator 1 off (fetch / put)";
IODescription005B = "Set game connector annunciator 1 on (fetch / put)";
IODescription005C = "Set game connector annunciator 2 off (fetch / put)";
IODescription005D = "Set game connector annunciator 2 on (fetch / put)";
IODescription005E = "Set game connector annunciator 3 off (fetch / put); enable double hires mode (fetch; //e only)";
IODescription005F = "Set game connector annunciator 3 on (fetch / put); disable double hires mode (fetch; //e only)";
IODescription0060 = "Read cassette tape input main (fetch)";		// $C060
IODescription0061 = "Read game paddle #0 push button main (fetch)";
IODescription0062 = "Read game paddle #1 push button main (fetch)";
IODescription0063 = "Read game paddle #2 push button main (fetch)";
IODescription0064 = "Read game paddle #0 timer main (fetch)";
IODescription0065 = "Read game paddle #1 timer main (fetch)";
IODescription0066 = "Read game paddle #2 timer main (fetch)";
IODescription0067 = "Read game paddle #3 timer main (fetch)";
IODescription0068 = "Read cassette tape input main (fetch)";
IODescription0069 = "Read game paddle #0 push button alternative (fetch)";
IODescription006A = "Read game paddle #1 push button alternative (fetch)";
IODescription006B = "Read game paddle #2 push button alternative (fetch)";
IODescription006C = "Read game paddle #0 timer alternative (fetch)";
IODescription006D = "Read game paddle #1 timer alternative (fetch)";
IODescription006E = "Read game paddle #2 timer alternative (fetch)";
IODescription006F = "Read game paddle #3 timer alternative (fetch)";
IODescription0070 = "Reset game paddle timers main (fetch / put)";		// $C070
IODescription0071 = "Reset game paddle timers alternative (fetch / put)";
IODescription0072 = "Reset game paddle timers alternative (fetch / put)";
IODescription0073 = "Reset game paddle timers alternative (fetch / put); read / set aux mem bank (fetch / put; //e only)";
IODescription0074 = "Reset game paddle timers alternative (fetch / put)";
IODescription0075 = "Reset game paddle timers alternative (fetch / put)";
IODescription0076 = "Reset game paddle timers alternative (fetch / put)";
IODescription0077 = "Reset game paddle timers alternative (fetch / put)";
IODescription0078 = "Reset game paddle timers alternative (fetch / put)";
IODescription0079 = "Reset game paddle timers alternative (fetch / put)";
IODescription007A = "Reset game paddle timers alternative (fetch / put)";
IODescription007B = "Reset game paddle timers alternative (fetch / put)";
IODescription007C = "Reset game paddle timers alternative (fetch / put)";
IODescription007D = "Reset game paddle timers alternative (fetch / put)";
IODescription007E = "Reset game paddle timers alternative (fetch / put)";
IODescription007F = "Reset game paddle timers alternative (fetch / put)";
// The next 16 are for the built-in language card of the Apple //e
IODescription0080 = "Area $D000-$FFFF: read RAM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0081 = "Area $D000-$FFFF: write RAM, read ROM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0082 = "Area $D000-$FFFF: write protect RAM, read ROM (fetch / put)";
IODescription0083 = "Area $D000-$FFFF: read and write RAM; use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0084 = "Area $D000-$FFFF: read RAM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0085 = "Area $D000-$FFFF: write RAM, read ROM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0086 = "Area $D000-$FFFF: write protect RAM, read ROM (fetch / put)";
IODescription0087 = "Area $D000-$FFFF: read and write RAM; use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0088 = "Area $D000-$FFFF: read RAM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription0089 = "Area $D000-$FFFF: write RAM, read ROM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription008A = "Area $D000-$FFFF: write protect RAM, read ROM (fetch / put)";
IODescription008B = "Area $D000-$FFFF: read and write RAM; use bank 1 of $D000-$DFFF (fetch / put)";
IODescription008C = "Area $D000-$FFFF: read RAM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription008D = "Area $D000-$FFFF: write RAM, read ROM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription008E = "Area $D000-$FFFF: write protect RAM, read ROM (fetch / put)";
IODescription008F = "Area $D000-$FFFF: read and write RAM; use bank 1 of $D000-$DFFF (fetch / put)";

// Descriptions for the peripheral card I/O addresses
// Disk ][ card
IODescription0100 = "Disk ][ card: stepper motor phase 0 off (fetch / put)";
IODescription0101 = "Disk ][ card: stepper motor phase 0 on (fetch / put)";
IODescription0102 = "Disk ][ card: stepper motor phase 1 off (fetch / put)";
IODescription0103 = "Disk ][ card: stepper motor phase 1 on (fetch / put)";
IODescription0104 = "Disk ][ card: stepper motor phase 2 off (fetch / put)";
IODescription0105 = "Disk ][ card: stepper motor phase 2 on (fetch / put)";
IODescription0106 = "Disk ][ card: stepper motor phase 3 off (fetch / put)";
IODescription0107 = "Disk ][ card: stepper motor phase 3 on (fetch / put)";
IODescription0108 = "Disk ][ card: turn motor off (fetch / put)";
IODescription0109 = "Disk ][ card: turn motor on (fetch / put)";
IODescription010A = "Disk ][ card: engage drive 1 (fetch / put)";
IODescription010B = "Disk ][ card: engage drive 2 (fetch / put)";
IODescription010C = "Disk ][ card: strobe data latch for I/O (fetch / put)";
IODescription010D = "Disk ][ card: load data latch / prepare sense write protect (fetch / put)";
IODescription010E = "Disk ][ card: prepare for input / sense write protect (fetch / put)";
IODescription010F = "Disk ][ card: prepare for output (fetch / put)";

// 16K RAM card
IODescription0300 = "16K RAM card: read RAM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0301 = "16K RAM card: write RAM, read ROM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0302 = "16K RAM card: write protect RAM, read ROM (fetch / put)";
IODescription0303 = "16K RAM card: read and write RAM; use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0304 = "16K RAM card: read RAM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0305 = "16K RAM card: write RAM, read ROM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0306 = "16K RAM card: write protect RAM, read ROM (fetch / put)";
IODescription0307 = "16K RAM card: read and write RAM; use bank 2 of $D000-$DFFF (fetch / put)";
IODescription0308 = "16K RAM card: read RAM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription0309 = "16K RAM card: write RAM, read ROM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription030A = "16K RAM card: write protect RAM, read ROM (fetch / put)";
IODescription030B = "16K RAM card: read and write RAM; use bank 1 of $D000-$DFFF (fetch / put)";
IODescription030C = "16K RAM card: read RAM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription030D = "16K RAM card: write RAM, read ROM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription030E = "16K RAM card: write protect RAM, read ROM (fetch / put)";
IODescription030F = "16K RAM card: read and write RAM; use bank 1 of $D000-$DFFF (fetch / put)";

// Mountain Computer AppleClock card
IODescription0400 = "Mountain Computer AppleClock card: read part of time + status (fetch)";
IODescription0401 = "Mountain Computer AppleClock card: read part of time (fetch)";
IODescription0402 = "Mountain Computer AppleClock card: read part of time (fetch)";
IODescription0403 = "Mountain Computer AppleClock card: read part of time (fetch)";
IODescription0404 = "Mountain Computer AppleClock card: read part of time (fetch)";
IODescription0405 = "Mountain Computer AppleClock card: start clock (fetch)";
IODescription0406 = "Mountain Computer AppleClock card: stop clock (fetch)";
IODescription0407 = "Mountain Computer AppleClock card: advance one or clear IRQ (fetch)";
IODescription0408 = "Mountain Computer AppleClock card: advance two or clear INT-OUT (fetch)";
IODescription0409 = "Mountain Computer AppleClock card: switch interrupts on / off (put)";
IODescription040A = "Mountain Computer AppleClock card: -";
IODescription040B = "Mountain Computer AppleClock card: -";
IODescription040C = "Mountain Computer AppleClock card: -";
IODescription040D = "Mountain Computer AppleClock card: -";
IODescription040E = "Mountain Computer AppleClock card: -";
IODescription040F = "Mountain Computer AppleClock card: -";

// Term 80 card
IODescription0500 = "Term 80 card";
IODescription0501 = "Term 80 card";
IODescription0502 = "Term 80 card";
IODescription0503 = "Term 80 card";
IODescription0504 = "Term 80 card";
IODescription0505 = "Term 80 card";
IODescription0506 = "Term 80 card";
IODescription0507 = "Term 80 card";
IODescription0508 = "Term 80 card";
IODescription0509 = "Term 80 card";
IODescription050A = "Term 80 card";
IODescription050B = "Term 80 card";
IODescription050C = "Term 80 card";
IODescription050D = "Term 80 card";
IODescription050E = "Term 80 card";
IODescription050F = "Term 80 card";

// Apple mouse card
IODescription0700 = "Apple mouse card: switch mouse on / off (put)";
IODescription0701 = "Apple mouse card: report mouse positions through input buffer (put)";
IODescription0702 = "Apple mouse card: set mouse mode (put)";
IODescription0703 = "Apple mouse card: control mouse (put)";
IODescription0704 = "Apple mouse card: -";
IODescription0705 = "Apple mouse card: -";
IODescription0706 = "Apple mouse card: -";
IODescription0707 = "Apple mouse card: -";
IODescription0708 = "Apple mouse card: -";
IODescription0709 = "Apple mouse card: -";
IODescription070A = "Apple mouse card: -";
IODescription070B = "Apple mouse card: -";
IODescription070C = "Apple mouse card: -";
IODescription070D = "Apple mouse card: -";
IODescription070E = "Apple mouse card: -";
IODescription070F = "Apple mouse card: -";

// Z80 card
IODescription0800 = "Z80 card: -";
IODescription0801 = "Z80 card: -";
IODescription0802 = "Z80 card: -";
IODescription0803 = "Z80 card: -";
IODescription0804 = "Z80 card: -";
IODescription0805 = "Z80 card: -";
IODescription0806 = "Z80 card: -";
IODescription0807 = "Z80 card: -";
IODescription0808 = "Z80 card: -";
IODescription0809 = "Z80 card: -";
IODescription080A = "Z80 card: -";
IODescription080B = "Z80 card: -";
IODescription080C = "Z80 card: -";
IODescription080D = "Z80 card: -";
IODescription080E = "Z80 card: -";
IODescription080F = "Z80 card: -";

// SCSI card
IODescription1000 = "SCSI card: -";
IODescription1001 = "SCSI card: -";
IODescription1002 = "SCSI card: -";
IODescription1003 = "SCSI card: -";
IODescription1004 = "SCSI card: -";
IODescription1005 = "SCSI card: -";
IODescription1006 = "SCSI card: -";
IODescription1007 = "SCSI card: -";
IODescription1008 = "SCSI card: -";
IODescription1009 = "SCSI card: -";
IODescription100A = "SCSI card: -";
IODescription100B = "SCSI card: -";
IODescription100C = "SCSI card: -";
IODescription100D = "SCSI card: -";
IODescription100E = "SCSI card: handle SmartPort I/O (fetch)";
IODescription100F = "SCSI card: handle ProDOS Block I/O (fetch)";

// ProDOS Clock card
IODescription1100 = "ProDOS Clock card: make ASCII time snapshot (fetch)";
IODescription1101 = "ProDOS Clock card: make binary time snapshot (fetch)";
IODescription1102 = "ProDOS Clock card: get next byte of time snapshot (fetch)";
IODescription1103 = "ProDOS Clock card: -";
IODescription1104 = "ProDOS Clock card: -";
IODescription1105 = "ProDOS Clock card: -";
IODescription1106 = "ProDOS Clock card: -";
IODescription1107 = "ProDOS Clock card: -";
IODescription1108 = "ProDOS Clock card: -";
IODescription1109 = "ProDOS Clock card: -";
IODescription110A = "ProDOS Clock card: -";
IODescription110B = "ProDOS Clock card: -";
IODescription110C = "ProDOS Clock card: -";
IODescription110D = "ProDOS Clock card: -";
IODescription110E = "ProDOS Clock card: -";
IODescription110F = "ProDOS Clock card: -";

// Super Serial card
IODescription1300 = "Super Serial card: -";
IODescription1301 = "Super Serial card: read switches bank 1 (fetch)";
IODescription1302 = "Super Serial card: read switches bank 2 and CTS (fetch)";
IODescription1303 = "Super Serial card: -";
IODescription1304 = "Super Serial card: -";
IODescription1305 = "Super Serial card: -";
IODescription1306 = "Super Serial card: -";
IODescription1307 = "Super Serial card: -";
IODescription1308 = "Super Serial card: receive / transmit data (fetch / put)";
IODescription1309 = "Super Serial card: ACIA status / reset register (fetch / put)";
IODescription130A = "Super Serial card: ACIA command register (fetch / put)";
IODescription130B = "Super Serial card: ACIA control register (fetch / put)";
IODescription130C = "Super Serial card: -";
IODescription130D = "Super Serial card: -";
IODescription130E = "Super Serial card: -";
IODescription130F = "Super Serial card: -";

// Grappler+ card
IODescription1400 = "Grappler+ card: output a byte (put); read status (fetch)";
IODescription1401 = "Grappler+ card: switch to second ROM bank (put); read status (fetch)";
IODescription1402 = "Grappler+ card: read status (fetch)";
IODescription1403 = "Grappler+ card: -";
IODescription1404 = "Grappler+ card: read status (fetch)";
IODescription1405 = "Grappler+ card: -";
IODescription1406 = "Grappler+ card: -";
IODescription1407 = "Grappler+ card: -";
IODescription1408 = "Grappler+ card: -";
IODescription1409 = "Grappler+ card: -";
IODescription140A = "Grappler+ card: -";
IODescription140B = "Grappler+ card: -";
IODescription140C = "Grappler+ card: -";
IODescription140D = "Grappler+ card: -";
IODescription140E = "Grappler+ card: -";
IODescription140F = "Grappler+ card: -";

// Mockingboard card
IODescription1500 = "Mockingboard card: -";
IODescription1501 = "Mockingboard card: -";
IODescription1502 = "Mockingboard card: -";
IODescription1503 = "Mockingboard card: -";
IODescription1504 = "Mockingboard card: -";
IODescription1505 = "Mockingboard card: -";
IODescription1506 = "Mockingboard card: -";
IODescription1507 = "Mockingboard card: -";
IODescription1508 = "Mockingboard card: -";
IODescription1509 = "Mockingboard card: -";
IODescription150A = "Mockingboard card: -";
IODescription150B = "Mockingboard card: -";
IODescription150C = "Mockingboard card: -";
IODescription150D = "Mockingboard card: -";
IODescription150E = "Mockingboard card: -";
IODescription150F = "Mockingboard card: -";

// Serial Printer card
IODescription1600 = "Serial Printer card: -";
IODescription1601 = "Serial Printer card: read switches bank 1 (fetch)";
IODescription1602 = "Serial Printer card: read switches bank 2 (fetch)";
IODescription1603 = "Serial Printer card: -";
IODescription1604 = "Serial Printer card: -";
IODescription1605 = "Serial Printer card: -";
IODescription1606 = "Serial Printer card: -";
IODescription1607 = "Serial Printer card: -";
IODescription1608 = "Serial Printer card: receive / transmit data (fetch / put)";
IODescription1609 = "Serial Printer card: ACIA status / reset register (fetch / put)";
IODescription160A = "Serial Printer card: ACIA command register (fetch / put)";
IODescription160B = "Serial Printer card: ACIA control register (fetch / put)";
IODescription160C = "Serial Printer card: -";
IODescription160D = "Serial Printer card: -";
IODescription160E = "Serial Printer card: -";
IODescription160F = "Serial Printer card: -";

// Thunderclock card
IODescription1700 = "Thunderclock card: command register (fetch / put)";
IODescription1701 = "Thunderclock card: -";
IODescription1702 = "Thunderclock card: -";
IODescription1703 = "Thunderclock card: -";
IODescription1704 = "Thunderclock card: -";
IODescription1705 = "Thunderclock card: -";
IODescription1706 = "Thunderclock card: -";
IODescription1707 = "Thunderclock card: -";
IODescription1708 = "Thunderclock card: clear IRQ and clear INT-OUT (fetch)";
IODescription1709 = "Thunderclock card: -";
IODescription170A = "Thunderclock card: -";
IODescription170B = "Thunderclock card: -";
IODescription170C = "Thunderclock card: -";
IODescription170D = "Thunderclock card: -";
IODescription170E = "Thunderclock card: -";
IODescription170F = "Thunderclock card: -";

// 128K Saturn card
IODescription1800 = "128K Saturn card: read RAM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription1801 = "128K Saturn card: write RAM, read ROM, use bank 2 of $D000-$DFFF (fetch / put)";
IODescription1802 = "128K Saturn card: write protect RAM, read ROM (fetch / put)";
IODescription1803 = "128K Saturn card: read and write RAM; use bank 2 of $D000-$DFFF (fetch / put)";
IODescription1804 = "128K Saturn card: activate 16K bank 1 (fetch / put)";
IODescription1805 = "128K Saturn card: activate 16K bank 2 (fetch / put)";
IODescription1806 = "128K Saturn card: activate 16K bank 3 (fetch / put)";
IODescription1807 = "128K Saturn card: activate 16K bank 4 (fetch / put)";
IODescription1808 = "128K Saturn card: read RAM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription1809 = "128K Saturn card: write RAM, read ROM, use bank 1 of $D000-$DFFF (fetch / put)";
IODescription180A = "128K Saturn card: write protect RAM, read ROM (fetch / put)";
IODescription180B = "128K Saturn card: read and write RAM; use bank 1 of $D000-$DFFF (fetch / put)";
IODescription180C = "128K Saturn card: activate 16K bank 5 (fetch / put)";
IODescription180D = "128K Saturn card: activate 16K bank 6 (fetch / put)";
IODescription180E = "128K Saturn card: activate 16K bank 7 (fetch / put)";
IODescription180F = "128K Saturn card: activate 16K bank 8 (fetch / put)";

// AppleScript support
ASNotSupportedOn2eErr = "Command is not supported on the Apple //e.";
ASNo80ColumnCardErr = "Command requires an 80-column card.";
ASInsertWrongDirectParamErr = "The parameter could not be interpreted as a POSIX path.";
ASInsertURLWrongDirectParamErr = "The parameter could not be interpreted as a URL.";
ASInsertURLMalformedURL = "The URL was malformed. It must conform to RFC 2396.";
ASInsertURLWrongDevice = "Inserting a URL disk only works with a floppy disk drive.";
ASInsertWrongDriveArgumentErr = "The device specified is not a disk drive.";
ASInsertAlreadyLoadedErr = "The disk drive already contains a disk.";
ASInsertNoDOSFolderErr = "Mounting a folder as a DOS disk cannot be done by a script.";
ASNoDiskSizeAllowedErr = "A disk size cannot be specified for a floppy disk.";
ASNoDiskSizeOutOfRangeErr = "The disk size must be between %d and %d.";
ASFileAlreadyExistsErr = "A file with this name already exists.";
ASInsertWrongCassArgumentErr = "The device specified is not a cassette recorder.";
ASCannotPlayTapeErr = "Unable to load this cassette tape file.";
ASTapeAlreadyLoadedErr = "The cassette recorder already contains a tape.";
ASCannotRecordTapeErr = "Unable to create this cassette tape file.";
ASDeviceCannotEjectErr = "This type of device doesn't support \"eject\".";
ASTypeWrongDirectParamErr = "The parameter has the wrong type.";
ASTypeWrongMachineArgumentErr = "The parameter could not be interpreted as a virtual machine.";
ASCantDoWhileFrozenErr = "Cannot perform this command while the machine is frozen.";
ASCantDoWhileInBreakErr = "Cannot perform this command while the machine is in an Inspector break.";
ASNoOpenAppleKeyErr = "This type of Apple II has no open Apple key.";
ASNoClosedAppleKeyErr = "This type of Apple II has no solid Apple key.";
ASWrongParamTypeErr = "Parameter has the wrong type.";
ASInvalidPaperSizeErr = "The paper length must be an integer number in the range 2 - 14.";
ASTearOffWrongParamErr = "The parameter could not be interpreted as a POSIX path.";
ASPrintInvalidPath = "The path is invalid.";
ASSamePictureWrongParamErr = "The parameter could not be interpreted as a file.";
ASSamePictureNoFileErr = "No such file exists.";
ASSamePictureWrongFileErr = "The file does not represent a picture.";
ASSamePictureWrongCoordsErr = "Error in parameter values. Refer to the description of the \"same picture\" command in the AppleScript dictionary of Virtual ][.";
ASWaitForScreenWrongFileParamErr = "The parameter could not be interpreted as a file.";
ASWaitForScreenNoFileErr = "No such file exists.";
ASWaitForScreenWrongFileErr = "The file specified does not represent a picture.";
ASWaitForScreenWrongParamsErr = "Error in parameter values. Refer to the description of the \"waiting until screen\" command in the AppleScript dictionary of Virtual ][.";
ASWaitForScreenIncompatibleFileErr = "The image file specified has the wrong format.";
ASWaitForScreenGenericErr = "An error occurred";
ASWriteFileWrongParamErr = "The parameter could not be interpreted as a POSIX path.";
ASWriteFileNoDirErr = "The path does not exist.";
ASFileCannotWrite = "Cannot write to the file specified.";
ASDumpMemoryInvalidStartAddress = "The starting address must be in the range 0 to 49151.";
ASDumpMemoryInvalidLength = "The length cannot be negative.";
ASDumpMemoryInvalidBank = "For this virtual machine, the bank number can be at most %d.";
